Repository: KDE/kigo
Catalog: po/*/kigo.po
Languages: ar, eo

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Axel Rousseau

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: axel@esperanto-jeunes.org

# @item undo/redo, %1 stone coordinate
source: White %1
ar: أبيض %1

# @item undo/redo
source: White passed
ar: أبيض مررها

# @item undo/redo, %1 stone coordinate
source: Black %1
ar: أسود %1

# @item undo/redo
source: Black passed
ar: أسود مررها

# @item undo/redo
source: White resigned
ar: أبض استقال

# @item undo/redo
source: Black resigned
ar: أسود استقال

# @item undo/redo, %1 response from Go engine
source: White %1
ar: أبيض %1

# @item undo/redo, %1 response from Go engine
source: Black %1
ar: أسود %1

source: Backend
ar: الخلفية
eo: Interno

source: Executable:
ar: تنفيذيّ:
eo: Programo:

source: Select the executable file to start the Go engine
ar: اختر الملف القابل للتنفيذ لبدء محرك غو
eo: Elekti la plenumeblan dosieron por lanĉi la Go-motoron

source: Parameters:
ar: المعاملات:
eo: Parametroj:

source: Add here the necessary parameters to start the Engine in GTP mode
ar: أضف هنا المعلمات الضرورية لبدء تشغيل المحرك في وضع GTP
eo: Aldoni ĉi tie la necesajn parametrojn por lanĉi la Motoron en GTP-reĝimo

source: This is the resulting engine command which will be used by Kigo
ar: هذا هو أمر المحرك الناتج الذي سيستخدمه كي غو
eo: Ĉi tio estas la rezulta motora komando, kiu estos uzata de Kigo

source: Indicates whether the Go engine works correctly
ar: يشير إلى ما إذا كان محرك غو يعمل بشكل صحيح
eo: Indikas ĉu la Go-motoro funkcias ĝuste

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Please select a Go engine that supports the <span style=" font-style:italic;">GnuGo Text Protocol (GTP)</span>. The indicator light turns green when the selected backend is working.</p></body></html>
ar: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"> يرجى تحديد محرك غو الذي يدعم <span style=" font-style:italic;">ميفاق نص GnuGo (GTP)</span>. يتحول ضوء المؤشر إلى اللون الأخضر عندما تعمل الواجهة الخلفية المحددة.</p></body></html>
eo: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html> <head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Bonvolu elekti Go-motoron kiu subtenas la <span style=" font-style:italic;">GnuGo Tekstan Protokolon (GTP)</span>. La indikila lumo fariĝas verda kiam la elektita backend funkcias.</p></body></html>

source: Appearance
ar: المظهر
eo: Aspekto

source: Display Board Labels
ar: اعرض ملصقات اللوحة
eo: Montri Tabulajn Etikedojn

source: Hint Visibility Time:
ar: وقت رؤية التلميح:
eo: Tempdaŭro de Konsila Videbleco:

source: Seconds
ar: ثانية
eo: Sekundoj

# @title:menu
source: &Game
ar: &لعبة
eo: &Ludo

# @title:menu
source: &Move
ar: ا&نقل
eo: &Movi

# @title:menu
source: &Settings
ar: إ&عدادات
eo: &Agordo

# @title:menu
source: &Dockers
ar: الأرص&فة

# @title:menu
source: Main Toolbar
ar: شريط الأدوات الرئيسة
eo: Ĉefa ilobreto

# @title:menu
source: Move Toolbar
ar: حرك شريط الأدوات
eo: Movi Ilobreton

# @info
source: Set up a new game…
ar: أعدّ لعبة جديدة...

source: Kigo Game Files (*.sgf)
ar: ملفات لعبة كي غو (*.sgf)
eo: Kigo Luddosieroj (*.sgf)

# @info
source: Set up a loaded game…
ar: أعدّ لعبة محملة...

# @info
source: Unable to load game…
ar: غير قادر على تحميل اللعبة…

# @info
source: Game saved…
ar: حُفظت اللعبة…

# @info
source: Unable to save game.
ar: غير قادر على حفظ اللعبة.

# @info
source: Game started…
ar: بدأت اللعبة…

# @item:intext
source: %1 (White)
ar: %1 (أبيض)

# @item:intext
source: %1 (Black)
ar: %1 (أسود)

source: %1 won with a score of %2.
ar: %1 فاز بنتيجة %2.
eo: %1 venkis kun poentaro de %2.

source: %1 won with a score of %2 (bounds: %3 and %4).
ar: %1 فاز بنتيجة %2 (الحدود: %3 و%4).
eo: %1 venkis kun poentaro de %2 (limoj: %3 kaj %4).

# @info
source: Undone move.
ar: تراجع عن الحركة.

# @info
source: Redone move.
ar: إعادة الحركة.

# @title:tab
source: General
ar: عام

# @title:tab
source: Themes
ar: السّمات

# @info
source: Backend was changed, restart necessary…
ar: تغيرت الواجهة الخلفية، إعادة التشغيل ضرورية...

# @info
source: White passed.
ar: أبيض مررها.

# @info
source: Black passed.
ar: أسود مررها.

# @action
source: Get More Games…
ar: احصل على المزيد من الألعاب…

# @action
source: Start Game
ar: ابدأ اللعبة
eo: Komenci Ludon

# @action
source: Finish Game
ar: أنهِ اللعبة
eo: Fini Ludon

# @action:inmenu Move
source: Pass Move
ar: مرر الحركة
eo: Pasi Movon

# @option:check
source: Show Move &Numbers
ar: ا&عرض أرقام الحركة

# @title:window
source: Game Setup
ar: إعداد اللعبة
eo: Ludo-Agordo

# @title:window
source: Information
ar: المعلومات
eo: Informoj

# @title:window
source: Moves
ar: الحركات
eo: Movoj

# @info
source: No move
ar: لا يوجد أي حركة

# @title:window
source: Error
ar: خطأ
eo: Eraro

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'DejaVu Sans'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Sans Serif'; font-size:10pt; color:#ff0000;">Kigo was unable to find a Go engine backend.</span></p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px; font-family:'Sans Serif'; font-size:10pt; color:#ff0000;"></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Sans Serif'; font-size:10pt;">If you are sure that you already installed a suitable Go engine, you might want to configure Kigo to use that engine. Otherwise you should install a Go engine (like GnuGo).</span></p></body></html>
ar: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'DejaVu Sans'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Sans Serif'; font-size:10pt; color:#ff0000;">لم يتمكن كي غو من العثور على واجهة خلفية لمحرك غو.</span></p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px; font-family:'Sans Serif'; font-size:10pt; color:#ff0000;"></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Sans Serif'; font-size:10pt;">إذا كنت متأكدًا من أنك ثبت محرك غو مناسب، فقد ترغب في ضبط كي غو لاستخدام هذا المحرك. وإلا فيجب عليك تثبيت محرك غو (مثل GnuGo).</span></p></body></html>
eo: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html> <head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'DejaVu Sans'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style =" font-family:'Sans Serif'; font-size:10pt; color:#ff0000;">Kigo ne povis trovi Go-motoran backend.</span></p> <p style= "-qt-paragraph-type:malplena; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px; font-family:'Sans Serif'; font-size:10pt; koloro:#ff0000;"></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left :0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Sans Serif'; font-size:10pt;" >Se vi certas, ke vi jam instalis taŭgan Go-motoron, vi eble volas agordi Kigo por uzi tiun motoron. Alie vi devus instali Go-motoron (kiel GnuGo).</span></p></body></html>

source: Configure Kigo…
ar: اضبط كي غو…

source: Computer (level %1)
ar: الحاسوب (المستوى %1)
eo: Komputilo (nivelo %1)

source: %1 Stone
ar: بلا أي حجر
eo: %1 Ŝtono

# Indication who played the last move
source: %1 (white)
ar: %1 (أبيض)
eo: %1 (blanka)

# Indication who played the last move
source: %1 (black)
ar: %1 (أسود)
eo: %1 (nigra)

source: White's turn
ar: دور الأبيض
eo: La vico de Blanka

source: Black's turn
ar: دور الأسود
eo: La vico de Nigra

source: %1 capture
ar: لا يوجد أي أسر
eo: %1 kapto

source: Handicap:
ar: الإعاقة:
eo: Handikapo:

source: Komi:
ar: الكومي:

source: 0.5 Points
ar: 0٫5 نقطة
eo: 0.5 Poentoj

source: Last move:
ar: آخر حركة:
eo: Lasta movo:

source: Move:
ar: الحركة:
eo: Movo:

source: White Player
ar: اللاعب الأبيض
eo: Blanka Ludanto

source: Captures:
ar: الأسر:
eo: Kaptoj:

source: Black Player
ar: اللاعب الأسود
eo: Nigra Ludanto

source: Finish Game
ar: أنهِ اللعبة
eo: Fini Ludon

# @item:valuesuffix
source: Stone
ar: حجر

# Time limit of a game in minutes
source: %1 minute
ar: 0 دقيقة
eo: %1 minuto

# Time limit of a game, hours, minutes
source: %1 hour, %2
ar: %1 ساعة و %2
eo: %1 horo, %2

# @item:valuesuffix
source: of %1
ar: من %1

source: White to play
ar: دور أبيض ليلعب
eo: Blanka ludendas

source: Black to play
ar: دور أسود ليلعب
eo: Nigra ludendas

source: Board size:
ar: حجم اللوح:
eo: Grandeco de la tabulo:

source: &Tiny (9x9)
ar: &ضئيل (9×9)
eo: &Eta (9x9)

source: Small (&13x13)
ar: &صغيرة (13×13)
eo: Malgranda (&13x13)

source: No&rmal (19x19)
ar: &عادي (19×19)
eo: No&rmala (19x19)

source: &Custom:
ar: م&خصّص:
eo: &Propra:

source: Handicap stones are an advantage for the black player. Black gets a number of stones on the board before the game starts.
ar: تعتبر أحجار الإعاقة ميزة للاعب الأسود. يحصل اللاعب الأسود على عدد من الأحجار على اللوحة قبل بدء اللعبة.
eo: Handikapaj ŝtonoj estas avantaĝo por la nigra ludanto. Nigro ricevas kelkajn ŝtonojn sur la tabulo antaŭ ol la ludo komenciĝas.

source: No handicap
ar: لا يوجد إعاقة
eo: Neniu handikapo

source: Komi are points given to the white player at the end of the game. It balances out the advantage black has by making the first move.
ar: الكومي هي نقاط تُمنح للاعب الأبيض في نهاية اللعبة. وهي توازن الميزة التي يتمتع بها اللاعب الأسود من خلال القيام بالحركة الأولى.
eo: Komi estas poentoj donitaj al la blanka ludanto ĉe la fino de la ludo. Ĝi ekvilibrigas la avantaĝon kiun nigro havas farante la unuan movon.

source: Points
ar: نقطة
eo: Poentoj

source: Event:
ar: الحدث:
eo: Evento:

source: Location:
ar: المكان:
eo: Loko:

source: Date:
ar: التّاريخ:
eo: Dato:

source: Round:
ar: الجولة:
eo: Rondo:

source: Score:
ar: النتيجة:
eo: Poentoj:

source: Continue:
ar: تابع:
eo: Daŭrigi:

source: of 999
ar: من 999
eo: el 999

source: Move
ar: حرّك
eo: Movi

source: Time limit:
ar: حدّ الوقت:
eo: Tempolimo:

source: &Computer
ar: ال&حاسب
eo: &Komputilo

source: &Name:
ar: الا&سم:
eo: &Nomo:

source: Weak
ar: ضعيف
eo: Malforta

source: Strong
ar: قوي
eo: Forta

source: C&omputer
ar: ال&حاسوب
eo: K&omputilo

source: Na&me:
ar: الا&سم:
eo: No&mo:

source: Start Game
ar: ابدأ اللعبة
eo: Komenci Ludon

source: The current game engine command with (optional) parameters
ar: أمر محرك اللعبة الحالي مع المعلمات (اختياري)
eo: La nuna ludmotora komando kun (laŭvolaj) parametroj

source: The graphical theme to be used
ar: السمة الرسومية المستخدمة
eo: La grafika etoso uzota

source: Determines whether board labels are shown
ar: يقرّر إذا كان يجب عرض ملصقات اللوحة
eo: Determinas ĉu tabuletikedoj estas montrataj

source: Move numbers are drawn onto stones if enabled
ar: سترسم أرقام الحركة على الأحجار إذا مُكنت
eo: Movnombroj estas desegnataj sur ŝtonoj se ebligite

source: Number of seconds for which a hint is visible
ar: عدد الثواني التي يكون فيها التلميح مرئيًا
eo: Nombro da sekundoj dum kiuj sugesto estas videbla

source: Is black a human player?
ar: هل أسود لاعب بشري؟
eo: Ĉu nigra estas homa ludanto?

source: The name of the black player
ar: اسم اللاعب الأسود
eo: La nomo de la nigra ludanto

source: The strength of the black player
ar: قوة اللاعب الأسود
eo: La forto de la nigra ludanto

source: Is white a human player?
ar: هل أبيض لاعب بشري؟
eo: Ĉu blanka estas homa ludanto?

source: The name of the white player
ar: اسم اللاعب الأبيض
eo: La nomo de la blanka ludanto

source: The strength of the white player
ar: قوة اللاعب الأبيض
eo: La forto de la blanka ludanto

source: Go board size
ar: حجم لوحة غو
eo: Go-tabulgrandeco

source: Komi
ar: الكومي

source: With komi you can give the black player some extra points
ar: مع الكومي يمكنك منح اللاعب الأسود بعض النقاط الإضافية
eo: Kun komi vi povas doni al la nigra ludanto kelkajn kromajn poentojn

source: Extra stones for the black player
ar: أحجار إضافية للاعب الأسود
eo: Kromaj ŝtonoj por la nigra ludanto

source: Kigo
ar: كي غو

source: KDE Go Board Game
ar: لعبة غو اللوحية لكيدي
eo: KDE Go-Tabulludo

source: Copyright (c) 2008-2010 Sascha Peilicke
ar: حقوق الطبع والنشر (ج) 2008-2010 ساشا بيليك
eo: Kopirajto (c) 2008-2010 Sascha Peilicke

source: Sascha Peilicke (saschpe)
ar: ساشا بيليك (ساسشبي)

source: Original author
ar: المؤلف الأصلي
eo: Origina aŭtoro

source: Yuri Chornoivan
ar: يوري تشيرنويفان

source: Documentation editor
ar: محرر التّوثيق
eo: Dokumenta redaktilo

source: Arturo Silva
ar: أرتورو سيلفا

source: Default theme designer
ar: مصمم السّمة المبدئيّة
eo: Defaŭlta etoso-dezajnisto

# @info:shell
source: Game to load (SGF file)
ar: اللعبة المراد تحميلها (ملف SGF)
eo: Ludo por ŝargi (SGF-dosiero)

# %1 stone coordinate
source: White %1
eo: Blanka %1

source: White passed
eo: Blanko pasis

# %1 stone coordinate
source: Black %1
eo: Nigra %1

source: Black passed
eo: Nigro pasis

source: White resigned
eo: White eksiĝis

source: Black resigned
eo: Black eksiĝis

# %1 response from Go engine
source: White %1
eo: Blanka %1

# %1 response from Go engine
source: Black %1
eo: Nigra %1

source: Set up a new game...
eo: Agordi novan ludon...

source: Set up a loaded game...
eo: Agordi ŝargitan ludon...

source: Unable to load game...
eo: Ne eblas ŝargi ludon...

source: Game saved...
eo: Ludo konservita...

source: Unable to save game.
eo: Ne eblas konservi ludon.

source: Game started...
eo: Ludo komenciĝis...

source: %1 (White)
eo: %1 (Blanka)

source: %1 (Black)
eo: %1 (Nigra)

source: Undone move
eo: Malfarita movo

source: Redone move
eo: Refari movon

source: General
eo: Ĝenerala

source: Themes
eo: Temoj

source: Backend was changed, restart necessary...
eo: Backend estis ŝanĝita, rekomenco necesas...

# @action
source: Get More Games...
eo: Akiri pliajn ludojn...

# @action:inmenu View
source: Show Move &Numbers
eo: Montri Movajn &Nombrojn

source: No move
eo: Neniu movo

source: Configure Kigo...
eo: Agordi Kigo...

source: Stone
eo: Ŝtono

source: of %1
eo: el %1

# @info:shell
source: gamefile
eo: luddosiero

# @info:shell
source: [gamefile]
eo: [luddosiero]
